app/Controllers/IuranController.php

    public function index()
    {
        // Fetch the necessary data
        $data['iuran_detail'] = $this->iuranModel
            ->select('tbl_iuran.*, kas.namaKas, kk.namaKK, user.nama') // pilih kolom yang dibutuhkan
            ->join('tbl_kas as kas', 'tbl_iuran.idKas = kas.idKas', 'left')
            ->join('tbl_kk as kk', 'tbl_iuran.noKK = kk.noKK', 'left') // gabungkan dengan tbl_kk berdasarkan noKK
            ->join('tbl_user as user', 'tbl_iuran.idUser = user.idUser', 'left') // gabungkan dengan tbl_user berdasarkan idUser
            ->findAll();

        $data['users'] = $this->userModel->findAll(); // Fetch all users
        $data['kas'] = $this->kasModel->findAll(); // Fetch all kas
        $data['kk'] = $this->kkModel->findAll(); // Fetch all kartu keluarga
---
SELECT `tbl_iuran`.*, `kas`.`namaKas`, `kk`.`namaKK`, `user`.`nama`
FROM `tbl_iuran`
LEFT JOIN `tbl_kas` as `kas` ON `tbl_iuran`.`idKas` = `kas`.`idKas`
LEFT JOIN `tbl_kk` as `kk` ON `tbl_iuran`.`noKK` = `kk`.`noKK`
LEFT JOIN `tbl_user` as `user` ON `tbl_iuran`.`idUser` = `user`.`idUser`
SELECT *
FROM `tbl_user`
SELECT *
FROM `tbl_kas`
SELECT *
FROM `tbl_kk`

    public function edit($id)
    {
        // Ambil data iuran berdasarkan ID
        $data['iuran'] = $this->iuranModel->find($id);
        if (!$data['iuran']) {
            return $this->response->setJSON(['status' => false, 'message' => 'Data tidak ditemukan.']);
        }

        // Ambil data untuk dropdown
        $data['users'] = $this->userModel->findAll(); // Ambil semua user
---
SELECT *
FROM `tbl_user`