app/Controllers/PengeluaranController.php

    public function index()
    {
        // Fetch the necessary data
        $data['pengeluaran_detail'] = $this->pengeluaranModel
            ->select('tbl_pengeluaran.*, kas.namaKas, user.nama') // pilih kolom yang dibutuhkan
            ->join('tbl_kas as kas', 'tbl_pengeluaran.idKas = kas.idKas', 'left') // gabungkan dengan tbl_kas berdasarkan idKas
            ->join('tbl_user as user', 'tbl_pengeluaran.idUser = user.idUser', 'left') // gabungkan dengan tbl_user berdasarkan idUser
            ->findAll();

        $data['users'] = $this->userModel->findAll(); // Fetch all users
        $data['kas'] = $this->kasModel->findAll(); // Fetch all kas
---
SELECT `tbl_pengeluaran`.*, `kas`.`namaKas`, `user`.`nama`
FROM `tbl_pengeluaran`
LEFT JOIN `tbl_kas` as `kas` ON `tbl_pengeluaran`.`idKas` = `kas`.`idKas`
LEFT JOIN `tbl_user` as `user` ON `tbl_pengeluaran`.`idUser` = `user`.`idUser`
SELECT *
FROM `tbl_user`
SELECT *
FROM `tbl_kas`