app/Controllers/WargaController.php

    public function index()
    {
        // Fetch the necessary data
        $data['warga_detail'] = $this->wargaModel
            ->select('tbl_warga.*, kk.namaKK') // pilih kolom yang dibutuhkan
            ->join('tbl_kk as kk', 'tbl_warga.noKK = kk.noKK', 'left') // gabungkan dengan tbl_kk berdasarkan noKK
            ->findAll();

        $data['kk'] = $this->kkModel->findAll(); // Fetch all kartu keluarga
---
SELECT `tbl_warga`.*, `kk`.`namaKK`
FROM `tbl_warga`
LEFT JOIN `tbl_kk` as `kk` ON `tbl_warga`.`noKK` = `kk`.`noKK`
SELECT *
FROM `tbl_kk`

    public function edit($nik)
    {
        // Ambil data iuran berdasarkan ID
        $data['warga'] = $this->wargaModel->find($nik);
---
SELECT *
FROM `tbl_warga`
WHERE `tbl_warga`.`nik` = '1234567890123461'